# SupportLayout Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HandRailType..::..SupportLayout Property
HandRailType Class See Also
---
The support layout method of the handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RailSupportsLayout SupportLayout { get; set; }
```

Visual Basic
---
```text
Public Property SupportLayout As RailSupportsLayout
	Get
	Set
```

Visual C++
---
```text
public:
property RailSupportsLayout SupportLayout {
	RailSupportsLayout get ();
	void set (RailSupportsLayout value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The rail has no support specified so the data being set is not applicable. |

# See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace